Repository: diegodlh/jamulus-es
Catalog: Recursos_OmegaT/jamulus-omegat.tmx
Source language: en_gb
Languages: es_es

source: Having trouble? Can't keep in time?
es_es: ¿Tienes problemas? ¿No puedes mantener el tiempo?

source: Home \> Using Jamulus
es_es: Inicio \> Uso de Jamulus

source: ONLY. LISTEN. TO. THE. SIGNAL. FROM. THE. SERVER!
es_es: ¡SOLO.ESCUCHA.LA.SEÑAL.DEL.SERVIDOR!

source: Or put another way, do not listen to your direct signal.
es_es: O dicho de otra manera, no escuches tu señal directa.

source: This is obviously hard for singers and some acoustic musicians, but even if your connection is good, when players aren't listening to their own signal coming back from the server, your synchronisation will suffer. (For the avoidance of doubt: this has nothing to do with the "mute" controls in Jamulus.)
es_es: Obviamente esto es difícil para cantantes y al tocar algunos instrumentos acústicos, pero aunque tu conexión sea buena, si no escuchas tu propia señal que vuelve del servidor, tu sincronización sufrirá. (Para que quede claro: esto no tiene nada que ver con los controles de "mute" en Jamulus.)

source: Further information about how to avoid listening to yourself (and help with other problems) can be found in the Troubleshooting FAQ section (currently under construction)
es_es: Se puede encontrar más información sobre cómo evitar escucharte a ti mismo (y ayuda con otros problemas) en la sección de FAQ sobre la Resolución de Problemas (aún en construcción)

source: You will need
es_es: Necesitarás

source: A PC with either Windows 10, MacBook/iMac OS X El Capitan (v10.11) or higher, or Linux.
es_es: Un PC bien con Windows 10, MacBook/iMac OS X El Capitan (v10.11) o posterior, o Linux.

source: Headphones to prevent echo or feedback (particularly if singing or playing acoustic instruments)
es_es: Auriculares para evitar eco o feedback (sobre todo si se canta o toca instrumentos acústicos)

source: A wired Internet connection (Ethernet, don't use Wi-Fi) with a speed of at least 200Kbps (0.2Mbps) up and down, with 800Kbps recommended (more details here). If you have a broadband connection of 10Mbits down and 1Mbps up, you're unlikely to run into any bandwidth-related issues using Jamulus.
es_es: Una conexión a internet por cable (Ethernet, no utilices Wi-Fi) con una velocidad de al menos 200Kbps (0,2Mbps) de subida y bajada; 800Kbps recomendado (más detalles aquí)). Si tienes una conexión de banda ancha de 10Mbits de bajada y 1Mbps de subida, es improbable que te encuentres con problemas relacionados con el ancho de banda utilizando Jamulus.

source: If you want to sing (or just talk) with other musicians, either a USB microphone or a mic you can connection to a socket on the PC (note that mics should have a sample/word rate of 48 kHz). But you can communicate over the text chat window if you don't have a mic.
es_es: Si quieres cantar (o simplemente hablar) con otros músicos, puedes utilizar un micrófono USB o uno de los que se conectan directamente al PC (ten en cuenta que los micrófonos deben tener una tasa de muestreo de 48 kHz). Pero te puedes comunicar a través de la ventana de chat si no tienes micrófono.

source: ¿Hablas español? Videotutorial en castellano!
es_es: ¡Aquí tienes un videotutorial en castellano!

source: Mixers with USB/Firewire/Thunderbolt generally output mixed-down signal on their analog output AND separate signals only (no mixed-down signal) on their digital output.
es_es: Generalmente las mesas de mezclas con USB/Firewire/Thunderbolt producen señales mezcladas en su salida analógica Y TAMBIÉN señales separadas solo (no una señal mezclada) en su salida digital.

source: A few Mixers with USB/Firewire/Thunderbolt will either send only a mixed down signal to the digital output (small/budget mixers), or else also ADD a stereo mix-down signal to the separate signals on the digital output.
es_es: Algunas mesas de mezclas con USB/Firewire/Thunderbolt enviarán solo una señal mezclada a la salida digital (mesas pequeñas/económicas), o si no también AÑADEN una señal mezclada a las señales separadas de la salida digital.

source: (Thanks to pcar75 for this information)
es_es: (Gracias a pcar75 por esta información)

source: Having problems?
es_es: ¿Tienes problemas?

source: Please see the Client Troubleshooting FAQ
es_es: Consulta el FAQ de Resolución de Problemas con el Cliente

source: Example Setups
es_es: Ejemplos de Configuración

source: Simple audio interface connection
es_es: Conexión simple de un interfaz de audio

source: This is an example Windows client installation with audio device Behringer U-CONTROL UCA202. The following instructions might be similar with other audio devices.
es_es: Este es un ejemplo de instalación de un cliente en Windows con un dispositivo de audio Behringer U-CONTROL UCA202. Las siguientes instrucciones pueden ser similares para otros dispositivos de audio.

source: The exact method of connecting your instrument will of course vary depending on your hardware.
es_es: El modo exacto de conectar tu instrumento variará dependiendo de tu hardware.

source: 1. Plug the interface into a USB port on your computer
es_es: 1. Enchufa el interfaz en un puerto USB de tu ordenador

source: Home \> Using Jamulus \> Hardware
es_es: Inicio \> Uso de Jamulus \> Hardware

source: In the future, always use the same USB port for the audio device.
es_es: En el futuro, siempre utiliza el mismo puerto USB para el dispositivo de audio.

source: Windows users: Download and install the free ASIO sound driver. Some people have also reported success using this ASIO native driver, although it's not listed on Behringer's product pages as of April 2020.
es_es: Usuarios de Windows: Descarga e instala el driver ASIO de audio gratuito. Algunas personas han tenido éxito utilizando este driver ASIO nativo, aunque no está listado en las páginas de producto de Behringer a fecha de abril del 2020.

source: 2. Start Jamulus
es_es: 2. Arranca Jamulus

source: Configure Jamulus to use the correct sound setup (see this excellent guide by Simon Tomlinson on Facebook).
es_es: Configura Jamulus para utilizar la configuración de audio correcta (ver esta excelente guía de Simon Tomlinson en Facebook).

source: Make sure you have switched off the monitor button on your Behringer U-CONTROL UCA202 (otherwise you will hear both the original sound you are sending to the Jamulus server as well as the returning sound, and may get feedback).
es_es: Asegúrate de haber apagado el botón de monitoreo en tu Behringer U-CONTROL UCA202 (de lo contrario escucharás tanto el sonido original que envías al servidor Jamulus como el sonido que vuelve del mismo, y podría ocasionar feedback).

source: 3. Plug in your instrument and headphones
es_es: 3. Enchufa tu instrumento y tus auriculares

source: Connect your instrument to the input plugs of the Behringer U-CONTROL UCA202. Plug in your headphones into the Behringer U-CONTROL UCA202.
es_es: Conecta tu instrumento a una entrada del Behringer U-CONTROL UCA202. Enchufa tus auriculares al Behringer U-CONTROL UCA202.

source: 4. Connect to a Jamulus server.
es_es: 4. Conéctate a un servidor Jamulus.

source: Have fun!
es_es: ¡Diviértete!

source: Other examples
es_es: Otros ejemplos

source: For the Jamulus software to run stable it is recommended to use a PC with at least 1.5GHz CPU frequency.
es_es: Para que el software Jamulus se ejecute con estabilidad se recomienda utilizar un PC con un procesador de al menos 1.5GHz.

source: This video documents a live jam session. I am using a Lexicon Omega USB audio card on a 2009 Mac Mini. My bandmates all use Windows 10 and have Behringer audio cards, e.g. the Behringer Xenyx 1204USB. My internet connection is 10 Mbps down / 1 Mbps upstream via DSL.
es_es: Este vídeo documenta una sesión jam en directo. Utilizo una tarjeta de audio USB Lexicon Omega en un Mac Mini del 2009. Mis compañeros de grupo utilizan todos Windows 10 y tienen tarjetas de audio Behringer, por ejemplo el Behringer Xenyx 1204USB. Mi conexión a internet tiene 10 Mbps de bajada / 1 Mbps de subida mediante conexión DSL.

source: Jamulus user Andrew Evans: With bandmates all within one city (but spanning 2 ISPs) and achieving consistent 20ms ping time, running the server on a separate dedicated Windows machine and a client on a Macbook Pro. Remote players on Macbook Air. Everyone on wired Ethernet connections to their home router/gateways. We used WhatsApp video to see each other (with audio muted - it's funny to see how far behind the Whatsapp audio lags from Jamulus though!)
es_es: El usuario de Jamulus Andrew Evans: Con todos los compañeros de grupo en la misma ciudad (pero con 2 ISPs diferentes) y un tiempo ping de 20ms estables, ejecutando el servidor en un ordenador Windows por separado y el cliente en un Macbook Pro. Los demás músicos con Macbook Air. Todos con conexión Ethernet por cable a sus routers/gateways. Utilizamos WhatsApp video para vernos (con el audio apagado - ¡pero es divertido ver lo atrás que queda el audio de Whatsapp con respecto a Jamulus!)

source: Windows users: Use a sound card with a native ASIO driver to ensure the lowest possible latencies. Or you can try using a free ASIO driver instead. Have a look at this basic setup guide.
es_es: Usuarios de Windows: Utiliza una tarjeta de sonido con driver ASIO nativo para garantizar la latencia más baja posible. O puedes probar a usar un driver ASIO gratuito en su lugar. Echa un vistazo a esta guía básica de configuración.

source: Compatible hardware
es_es: Hardware compatible

source: Success with Jamulus is partially dependent on the quality of your audio device / sound card. Some built-in sound cards will not have low enough latency, or good enough hardware, to work properly. Please see this list of known good hardware.
es_es: Utilizar Jamulus con éxito depende parcialmente de la calidad de tu dispositivo / tarjeta de audio. Algunas tarjetas de audio internas no tendrán una latencia lo suficientemente baja, o el hardware apropiado, para funcionar correctamente. Consulta esta lista de hardware comprobado.

source: Points to note about inputs
es_es: Apuntes sobre las entradas

source: If you want to connect 2 or more sources (eg voice + synth + guitar), it is important to note that Jamulus currently handles only input 2 channels (L/R). So the hardware being used must provide a mixed-down stereo output to Jamulus.
es_es: Si quieres conectar 2 o más fuentes de audio (por ej. voz + sinte + guitarra), es importante tener en cuenta que actualmente Jamulus solo acepta 2 canales de entrada (L/R). Por lo tanto, el hardware utilizado debe proporcionar una salida mezclada a estéreo a Jamulus.

source: Audio interfaces generally output a mixed signal on their analog output, but separate signals (1 per source) on their digital output (USB/Firewire/Thunderbolt).
es_es: Generalmente los dispositivos de audio producen una señal mezclada en su salida analógica, pero señales separadas (1 por fuente) en su salida digital (USB/Firewire/Thunderbolt).

source: Mixers generally only output mixed-down signals on their analog output.
es_es: Generalmente las mesas de mezclas solo producen señales mezcladas en su salida analógica.

source: This is the home of the official documentation for Jamulus.
es_es: Esta es la página de inicio de la documentación oficial para Jamulus.

source: To get playing with Jamulus - START HERE
es_es: Para ponerte a tocar con Jamulus - EMPIEZA AQUÍ

source: For detailed information about how Jamulus hacks the space-time continuum to produce a near-perfect 5th dimension of collaborative sound, see this paper by Volker Fischer.
es_es: Para información detallada sobre cómo Jamulus hackea el continuo espacio-tiempo para producir una 5ª dimensión cuasi-perfecta de sonido colaborativo, consulta este documento de Volker Fischer (inglés).

source: On Debian 11 (bullseye) or later, and Raspberry Pi Raspbian Buster release or later, use:
es_es: En Debian 11 (bullseye) o posteriores, y la versión de Raspberry Pi Raspbian Buster o posterior, utiliza:

source: sudo apt-get install build-essential qtdeclarative5-dev qt5-default qttools5-dev-tools libjack-jackd2-dev
es_es: sudo apt-get install build-essential qt5-qmake qtdeclarative5-dev qt5-default qttools5-dev-tools libjack-jackd2-dev

source: On Fedora use:
es_es: En Fedora utiliza:

source: Optional, but recommended
es_es: Opcional, pero recomendado

source: QjackCtl is a utility to help you set up Jack (installed as part of the dependencies above):
es_es: QjackCtl es una utilidad para ayudarte a configurar Jack (instalado como parte de las dependencias mencionadas arriba):

source: You may also wish to consider using a low-latency kernel (eg. for Ubuntu 18.04: sudo apt-get install linux-lowlatency-hwe-18.04).
es_es: También puedes plantearte usar un kernel low-latency (por ej. para Ubuntu 18.04: sudo apt-get install linux-lowlatency-hwe-18.04).

source: Compile this bad boy
es_es: Compílalo

source: Home \> Using Jamulus \> Linux installation
es_es: Inicio \> Uso de Jamulus \> Instalación en Linux

source: Now cd into the jamulus sources directory you downloaded (either with git or after downloading the .zip file):
es_es: Ahora cd a la carpeta de las fuentes de Jamulus que has descargado (con git o tras descargar el archivo .zip):

source: and compile the sources with the following commands (the last make may take several minutes to run):
es_es: y compila las fuentes con los siguientes comandos (el último make puede tardar varios minutos):

source: Next, set up your sound card to work with Jamulus
es_es: Ahora configura tu tarjeta de sonido para que funcione con Jamulus

source: Jamulus clients need Jack to run, but you need to configure that first. The recommended method is to use QjackCtl. The exact settings for Jack will depend on what your audio interface/sound card is capable of.
es_es: Los clientes de Jamulus necesitan Jack para funcionar, pero hay que configurarlo primero. El método recomendado es utilizar QjackCtl. La configuración exacta de Jack dependerá de lo que es capaz tu interfaz/tarjeta de audio.

source: Configure Jack to do the following:
es_es: Configura Jack para hacer lo siguiente:

source: Set the audio Interface to the one you want (there may be several in the list)
es_es: Elige el Interfaz que quieres utilizar (puede haber varios en la lista)

source: Set the Sample Rate to 48000
es_es: Establece la Frecuencia de Muestreo en 48000

source: Set the Frames/Period to 128 and Periods/Buffer at 2 at first
es_es: Establece los Cuadros/Periodo en 128 y Periodos/Buffer en 2 para empezar

source: Right now, we don't have any official packages available for Jamulus, but compiling the sources is quite easy.
es_es: Ahora mismo no tenemos paquetes oficiales disponibles para Jamulus, pero compilar las fuentes es bastante sencillo.

source: Restart Jack to take any new settings
es_es: Reinicia Jack para que surta efecto la nueva configuración

source: To run Jamulus, type Jamulus (with a capital J) on the command line (you should see the Jamulus client window appear)
es_es: Para ejecutar Jamulus, escribe Jamulus (con J mayúscula) en la línea de comandos (debería abrirse el cliente de Jamulus)

source: Jamulus puts itself into /usr/local/bin. You can now delete the sources directory you compiled from.
es_es: Jamulus se instala en /usr/local/bin. Ahora puedes eliminar la carpeta de las fuentes si quieres.

source: If you get problems with sound breaking up (in particular XRUN errors reported by Jack/QJackCtl) try setting bigger values (eg 256 frames or 3 periods) in step 3 above, or lower ones (eg 64 frames) for better performance. See the troubleshooting page otherwise.
es_es: Si tienes problemas con cortes de sonido (en particular errores de XRUNmostrados por Jack/QJackctl) prueba con valores más altos (por ej. 256 cuadros o 3 periodos) en el paso 3 anterior, o más bajos (por ej. 64 cuadros) para un mejor rendimiento. Si no, ver la página de resolución de problemas.

source: Have a look also at Hardware Setup.
es_es: Consulta también la Configuración de Hardware

source: To update your installation to a new release
es_es: Para actualizar tu instalación a una nueva versión

source: Download the new sources as per Get Jamulus and repeat just the compilation instructions as if for a new installation above.
es_es: Descarga las nuevas fuentes como en Obtén Jamulus y repite solamente las instrucciones de compilación como si fuera una nueva instalación.

source: Notes for geeks
es_es: Nota para frikis

source: The "make clean" is essential to remove the automatically generated Qt files which are present in the .tar.gz file and may not match the Qt version you are using.
es_es: "make clean" es esencial para eliminar los archivos de Qt generados automáticamente los cuales están presentes en el archivo .tar.gz y que quizá no concuerden con la versión de Qt que estás utilizando.

source: To use an external shared OPUS library instead of the built-in use qmake "CONFIG+=opus_shared_lib" Jamulus.pro.
es_es: Para utilizar una librería compartida de OPUS en lugar del que viene integrado usa qmake "CONFIG+=opus_shared_lib" Jamulus.pro.

source: Get Jamulus
es_es: Obtén Jamulus

source: To use this file configure the software with qmake "CONFIG+=noupcasename" Jamulus.pro to make sure the output target name of this software is jamulus instead of Jamulus.
es_es: Para utilizar este archivo configura el software con qmake "CONFIG+=noupcasename" Jamulus.pro para asegurarte de que el nombre de destino de este software es jamulus en lugar de Jamulus.

source: Users of Raspberry Pi: You may want to compile the client on another machine and run the binary on the Raspberry Pi. In which case, the only libraries you need to run it are those for a headless server build, but with the Jack sound packages.
es_es: Usuarios de Raspberry Pi: quizá quieras compilar el cliente en otra máquina y ejecutar el archivo binario en el Raspberry Pi. En este caso, las únicas librerías que necesitas para ejecutarlo son aquellos necesarios para la compilación de un servidor "headless" pero con las librerías de audio para Jack.

source: As of version 3.5.3, Jamulus is no longer compatible with Qt4.
es_es: A partir de la versión 3.5.3, Jamulus ya no es compatible con Qt4.

source: Open up a terminal window (command line - CTRL+ALT+t on Ubuntu and related distros), and download and unzip the sources for the latest release.
es_es: Abre una terminal (línea de comandos - CTRL+ALT+t en Ubuntu y distros relacionadas), y descarga y descomprime las fuentes para la última versión desde aquí.

source: If you wish to use git (sudo apt install git), use this to get the latest release instead:
es_es: Si quieres usar git (sudo apt install git), utiliza esto para obtener la última versión oficial:

source: Install the dependent packages
es_es: Instala las dependencias

source: On Ubuntu-based distributions 18.04+, and on Debian 9 or 10, use this:
es_es: En distros basadas en Ubuntu 18.04+ y en Debian 9 o 10, utiliza esto:

source: First, sudo apt-get update (or you may get "not found" messages)
es_es: Primero, sudo apt-get update (de lo contrario puedes obtener mensajes de "no encontrado")

source: You will then get a slightly different version of the same message, which allows you to click Open and go ahead with running it. You will not be shown this warning again - just double-click it to run after that. For more information see this Apple Support Page.
es_es: Ahora verás una versión ligeramente diferente del mismo mensaje, que te permite hacer clic para Abrir y ejecutarlo. No se te mostrará esta advertencia más - simplement haz doble clic para ejecutarlo en adelante. Para más información consulta esta página de Soporte para Apple.

source: Have a look at Hardware Setup
es_es: Mírate la Configuración de Hardware

source: See also this excellent guide by Simon Tomlinson (or directly on Facebook).
es_es: Ver también esta excelente guía de Simon Tomlinson (o directamente en Facebook).

source: Home \> Using Jamulus \> Macintosh installation
es_es: Inicio \> Uso de Jamulus \> Instalación en Macintosh

source: Download the latest version
es_es: Descarga la última versión

source: Double-click on the .zip file, which will create new folder of same name. The folder contains the license file and a .dmg file containing the application.
es_es: Haz doble clic en el archivo .zip, que creará una nueva carpeta con el mismo nombre. La carpeta contiene el archivo de la licencia y un archivo .dmg que contiene la aplicación.

source: Double-click the .dmg file to open it. It will unpack and you will see two files (Jamulus client and server): drag them to your Applications folder.
es_es: Haz doble clic en el archivo .dmg para abrirlo. Se descomprimirá y verás dos archivos (cliente y servidor Jamulus): arrástralos a tu carpeta de Aplicaciones.

source: Now you should be able to use Jamulus just like any other application.
es_es: Ahora deberías de poder usar Jamulus como cualquier otra aplicación.

source: You can remove the folder in the Downloads directory containing the .dmg and eject the "Jamulus" drive on your desktop. They are no longer needed.
es_es: Puedes eliminar la carpeta en el directorio de Descargas que contiene el archivo .dmg y expulsar la unidad "Jamulus" del escritorio. Ya no son necesarios.

source: You can also compile your own binary if you feel so inclined.
es_es: También puedes compilar tu propio archivo binario si así lo deseas.

source: The first time you try to double-click Jamulus to run it, you will probably see a message saying it cannot be opened.
es_es: La primera vez que hagas doble clic en Jamulus para ejecutarlo, probablemente verás un mensaje diciendo que no puede abrirse.

source: To fix this, click on Jamulus in the Applications folder, right-click (or control-click), and select Open from the top of the menu.
es_es: Para solucionarlo, haz clic en Jamulus en la carpeta de Aplicaciones, haz clic derecho (o control-clic), y selecciona Abrir de la parte superior del menú.

source: Home \> Using Jamulus \> Windows installation
es_es: Inicio \> Uso de Jamulus \> Instalación en Windows

source: Download and install an ASIO Driver. It is recommended to use a sound card with a native ASIO driver, or install this free ASIO driver before installing Jamulus.
es_es: Descarga e instala un driver ASIO. Se recomienda usar una tarjeta de audio con driver ASIO nativo, o instalar este driver ASIO gratuito antes de instalar Jamulus.

source: Afterwards download and run the Jamulus Windows installer (or compile Jamulus yourself if you feel inclined).
es_es: Después descarga y ejecuta el instalador para Windows de Jamulus (o compila Jamulus si quieres).

source: If you get a warning notice, click on "More info" and "Run anyway" to install Jamulus.
es_es: Si te aparece un mensaje de advertencia, haz clic en "Más info" y "Ejecutar de todos modos" para instalar Jamulus.

source: When you're done, have a look at how to setup ASIO4All (scroll down) if you you're using that, and Hardware Setup.
es_es: Una vez hecho, mira cómo configurar ASIO4All (consulta abajo) si es lo que vas a utilizar, y la Configuración de Hardware.

source: Setting up ASIO4All
es_es: Configurar ASIO4All

source: ASIO4All is not recommended if your audio interface provides its own ASIO driver, since that might have better latency.
es_es: ASIO4All no se recomienda si tu interfaz de audio tiene su propio driver ASIO, puesto que este último podría proporcionar mejor latencia.
